{
  "basics": {
    "name": "Andrés Ávila Acosta",
    "label": "Software Engineer",
    "picture": "",
    "email": "andaviaco@gmail.com",
    "phone": "(+52) 1 331 766 0221",
    "summary": "Software Developer and self-motivated learner. If I find something interesting I try to learn as much as possible to use it in real-world problems for work, school or personal projects. I like contributing giving my opinion and point of view and have no problem sharing my knowledge, especially with my coworkers. When facing problems, I create clean, simple and practical solutions with the best practices following agile methodologies.",
    "location": {
        "city": "Guadalajara",
        "region": "Jalisco",
        "countryCode": "MX"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "@andaviaco",
        "url": "https://github.com/andaviaco"
      },
      {
        "network": "LinkedIn",
        "username": "linkedin.com/in/andres-avila",
        "url": "https://linkedin.com/in/andres-avila/en"
      }
    ]
  },
  "work": [
    {
        "company": "Kimanta",
        "position": "Software Engineer",
        "website": "https://kimanta.com",
        "startDate": "January 2017",
        "summary": "A growing real-estate professionals network.",
        "highlights": [
          "Design and development of a high-performance service designed to be deployed in AWS that stores and process files to create and serve preview images or resized images, and create on-demand images stored temporally. Using PyPy, CherryPy and Redis.",
          "Refactoring and optimization of legacy code in Laravel to apply a modern architecture with Laravel 5.4. Replacing raw DB queries with Eloquent and the Query Builder. Implementing Interfaces, Traits, Contracts, Facades, Scopes, Mutators, Validators. Setup Sentry as error reporter.",
          "Refactoring and optimization of legacy AngularJS code to implement a component-based architecture. Implementing Angular components instead of directives and ReactJS for special features."
        ]
    },
    {
      "company": "Freelance",
      "startDate": "January 2017",
      "summary": "As a freelance I have had the freedom to experiment with new and exciting technologies in both, Frontend and Backend.",
      "highlights": [
        "Built a complete website that interacts with an external API. I used Python in the server, Preact for dynamic components in the frontend; SCSS and Flexbox techniques for the design.",
        "Built a fast and simple webapp for the professors of the Electronics Department at CUCEI. For a fast development I chose Flask in the server in order to achieve the release in a short deadline, Preact with Webpack and Bulma as CSS framework. The database was seeded from an Excel file with a script that I wrote to parse, load and save the data with SQLAlchemy.",
        "Implementation, personalization and deployment of a Ghost blog.",
        "Deployments in AWS, Heroku and Digital Ocean.",
        "Implementation of ReactJS inside a Wordpress app, with Redux to consume an API, React Router to handle the views with tabs and React Intl with a custom configuration for the translations."
      ]
    },
    {
      "company": "CORB Consultoría Informática",
      "position": "Software Engineer",
      "website": "http://corb.mx",
      "startDate": "August 2014",
      "endDate": "December 2016",
      "summary": "CORB is a software development company that offers high quality software solutions and training. I was invited to collaborate when I was a freshman at the University. Even though I had no experience, my skills proved I had a place in the team.",
      "highlights": [
        "Built an isomorphic/universal application using mainly ExpressJS, ReactJS and RethinkDB with an external API connection. We used Redux to manage data flow, SASS for styles and Webpack as module bundler.",
        "Worked with a team under a SCRUM methodology to develop a big website for real-estate professionals with AngularJS, Laravel, MySQL, SASS and other tecnologies.",
        "Worked on a high traffic application to create and vote stories with social networks integration using ReactJS, BackboneJS, Browserify and Gulp for the front-end, Lumen as back-end framework and Gulp for task automatization. React was in its firsts steps and we had to create components for sliders and an infinite scroll, both components loaded the data dynamically.",
        "Built a high-performance e-commerce for an auto parts seller, building a server with Flask + MongoDB and ReactJS rendering with Bootstrap in a PHP client.",
        "Built a simple website that connects with an API previously developed. We only use Flask, SASS with Flexbox styles and a bit of javascript.",
        "Developed an AngularJS module for client-side data persistence using localStorage.",
        "Was part of a team to build an application for a security system company to manage clients, appointments, payments and purchases using AngularJS, Jade (now Pug) templates, SASS with Bootstrap and Laravel + MySQL for the server.",
        "Built small modules for Moodle with PHP, MySQL, Javascript (JQuery) and Bootstrap.",
        "Instructor of two AngularJS workshops."
      ]
    },
    {
      "company": "Dgogo Studios",
      "position": "Web Developer",
      "website": "http://dgogostudios.com",
      "startDate": "June 2013",
      "endDate": "July 2013",
      "summary": "Blog about movies and TV.",
      "highlights": [
        "Built from scratch.",
        "First personal project for learning web development.",
        "Learned Django, Javascript, HTML and CSS",
        "Learned about UI and UX.",
        "First approach to Responsive Desing.",
        "Learned about servers and deployment of Python applications."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Guadalajara",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2013",
      "endDate": "June 2018",
      "gpa": "",
      "courses": []
    }
  ],
  "skills": [
    {
      "name": "Front-end",
      "level": "Advanced",
      "keywords": [
        "ReactJS",
        "Preact",
        "Redux",
        "AngularJS",
        "Webpack",
        "ES6",
        "BackboneJS",
        "Gulp",
        "SASS",
        "HTML"
      ]
    },
    {
      "name": "Back-end",
      "level": "Advanced",
      "keywords": [
        "NodeJS",
        "Django",
        "Flask",
        "Express",
        "Laravel",
        "CherryPy",
        "PHP"
      ]
    },
    {
        "name": "Databases",
        "level": "Intermediate",
        "keywords": [
            "MongoDB",
            "MariaDB",
            "Redis",
            "MySQL",
            "PostgreSQL"
        ]
    },
    {
      "name": "Scripting",
      "level": "Advanced",
      "keywords": [
        "Python 2.x",
        "Python 3.x",
        "Bash"
      ]
    },
    {
        "name": "Mobile",
        "level": "Beginner",
        "keywords": [
            "React Native",
            "Ionic Framework"
        ]
    },
    {
      "name": "VCS",
      "level": "Intermediate",
      "keywords": [
        "GIT"
      ]
    },
    {
      "name": "Methodologies",
      "level": "Intermediate",
      "keywords": [
        "SCRUM"
      ]
    },
    {
      "name": "More",
      "level": "Intermediate",
      "keywords": [
        "Vagrant",
        "Nginx",
        "Gunicorn",
        "Apache"
      ]
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Intermediate"
    }
  ],
  "interests": [],
  "references": []
}
